[
    {
      "id": 1,
      "title": "Owner",
      "meta": "Blueprint Software Labs, LLC",
      "text": [
        "Independent Software Architect and Lead Developer.",
        "Served as technical lead across multiple client projects, managing architecture, delivery, and engineering mentoring.",
        "Specialized in performance optimization, full stack web development, and CI/CD automation.",
        "Trained and coached developers on software design patterns, architecture principles, and dev workflow best practices.",
        "Built and deployed production-ready full stack systems across .NET, Node.js, and modern front-end frameworks.",
        "Drove initiatives for developer onboarding, engineering standards, and technical documentation."
      ],
      "year": "Jul 2024 — Present"
    },
    {
      "id": 2,
      "title": "Software Architect",
      "meta": "ABOUT Healthcare",
      "text": [
        "Led architectural strategy and engineering management for two full stack .NET and Vue.js teams.",
        "Designed and implemented greenfield microservices to replace a legacy monolith, enabling modular development.",
        "Improved API performance and streamlined deployment pipelines.",
        "Mentored developers on architecture, testing, and agile workflows.",
        "Redesigned the front-end build process and reduced Azure DevOps build times from over 60 minutes to 20 minutes.",
        "Collaborated with stakeholders on roadmap planning, backlog grooming, and project sequencing."
      ],
      "year": "Oct 2023 — Jul 2024"
    },
    {
      "id": 3,
      "title": "Software Architect",
      "meta": "Viagio Technologies",
      "text": [
        "Acted as lead developer and architect across multiple client engagements, delivering both short and long-term projects.",
        "Designed backend systems using Java, .NET, and Node.js with strong focus on scalability and maintainability.",
        "Built modern front-end applications using React and Angular.",
        "Created engineering growth rubrics and mentorship plans to support career development.",
        "Led requirements gathering, task estimation, and technical team leadership throughout the SDLC.",
        "Delivered internal training, presentations, and onboarding sessions for junior and mid-level developers."
      ],
      "year": "Dec 2020 — Oct 2023"
    }
]
  